// #pragma once

// #include "../initGame.h"

// class  Yuri{
//     vector<string> endingScreenFile;
// public:
//     Yuri();
//     vector<string> Ending;
//     vector<Texture> endScreen;
//     vector<vector<string>> YuriTalk, userTalk, YuriQuestions;
//     vector<vector<vector<string>>> userAnswers, YuriAction;
//     vector<vector<vector<int>>> actionRelation;
//     vector<vector<vector<Texture>>> ActionImage;
//     vector<vector<Texture>>  YuriActionImageTalk, YuriQusImageTalk;
//     Texture Y1;
//     Texture Y2;
//     Texture Y3;
//     Texture Y4; 
//     Texture Y5;
//     Texture Y6;
//     Texture Y7;
//     Texture Y8;
//     Texture Y9;
//     Texture Y10;
//     Texture Y11;
//     Texture Y12;
//     Texture Y13;
//     Texture Y14;
//     Texture Y15;
//     Texture Y16;
//     Texture Y17;
//     Texture Y18;
//     Texture Y19;
//     Texture Y20;
//     Texture Y21;
//     Texture Y22;
// };


// Yuri::Yuri() {

//     // ภาพตัวแทนตัวละคร Yuri
//     Y1.loadFromFile("../GG_Game/charecter/Yuri/Coliseum/Yuriangry.PNG");
//     Y2.loadFromFile("../GG_Game/charecter/Yuri/Coliseum/Yuriemotiondamage.PNG");
//     Y3.loadFromFile("../GG_Game/charecter/Yuri/Coliseum/Yuriemotiondamage1.PNG");
//     Y4.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentihappy.PNG");
//     Y5.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentigumact.PNG");

//     Y6.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentifirstday.PNG");

//     Y7.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentifeedgood.PNG");
//     Y8.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentienough.PNG");
//     Y9.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentizzz.PNG");
//     Y10.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/YentiYerysad.PNG");
//     Y11.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentismeiltalk.PNG");
//     Y12.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentismeil.PNG");
//     Y13.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentishy.PNG");
//     Y14.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentiscary.PNG");
//     Y15.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentisadtalk.PNG");
//     Y16.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentisad.PNG");
//     Y17.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentilaught.PNG");
//     Y18.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentinocharect.png");
//     Y19.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentiunknow.PNG");
//     Y20.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentismeilshy.PNG");
//     Y21.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentishyangry.PNG");
//     Y22.loadFromFile("../GG_Game/charecter/Yenti/Coliseum/Yentiemotiondage2.PNG");

//     endingScreenFile = {"../GG_Game/image/background/Yentifinal1.PNG", 
//                     "../GG_Game/image/background/Yurifinal2.PNG",
//                     "../GG_Game/image/background/Yurifinal3.PNG"
//                     };

//     endScreen.resize(endingScreenFile.size());
    
//     for (i = 0; i < 3; i++){
//         endScreen[i].loadFromFile(endingScreenFile[i]);
//     }



//     YuriTalk = {


    

//         // วันที่ 1
//         {
//             ".............................",
//             "Yuri :เราชื่อยูริน่ะ",
//             "Yuri :วันนี้คุยสนุกมาเลย ฉันอยากรู้จักเธอจังเลย"
//         },

//         // วันที่ 2
//         {
//             "Yuri :สวัสดี คุณผู้คุม",
//             "Yuri :จะว่าไงดีล่ะก็คนที่ชื่อว่า Neuvillette บอกว่าเขาจะพิพากษาชั้นน่ะสิ",
//             "Yuri :ฉันเริ่มชักจะสนใจเธอสะแล้วซิ"
//         },

//         // วันที่ 3
//         {
//             "Yuri :สวัสดี คุณผู้คุม....",
//             "Yuri :อย่าเงียบซี่........",
//             "Yuri :คุยกับเธอนี่มันสนุกดีน่ะ อยากได้ของฝากอ่ะ"
//         },

//         // วันที่ 4
//         {
//             "เมื่อคุณมาถึงพบว่า Yuri กำลังหลับอยู่",
//             "ตอนนั้นคุณเหลือบไปเห็นรูปภาพที่วางอยู่ใกล้ๆหน้าของเวนติ",
//             "Yuri :วันพรุ่งนี้เดี่ยวเล่าเรื่องราว เกี่ยวกับภาพนั้นให้ฟัง"
//         },

//         // วันที่ 5
//         {
//             "วันนี้คุณได้มาหาเวนติเพื่อนั่งคุยเล่นปกติ",
//             "Yuri :ฉันจะเล่าให้เธอฟังเกี่ยวกับภาพนั้น แต่เล่าปกติไม่สนุกให้ทายล่ะกัน-w-",
//             "Yuri :ซึ่งจริงๆในภาพนั้น ก็มีชั้นที่เป็วิญญาณธาตุลมตัวน้อยกับเพื่อนสนิทของข้า"
//         },

//         // วันที่ 6
//         {
//             "วันนี้ Yuri หน้าตาดูเศร้าหมอง",
//             "Yuri :คุณผู้คุ้มมมมมมม............................",
//             "ก่อนที่คุณจะจากไปคุณได้บอกกับ Yuri "
//         },

//         // วันที่ 7
//         {
//             "วันตัดสินก็มาถึง",
//             "Yuri :วันสุดท้ายแล้วสิน่ะ",
//             "คุณได้จากลา Yuri เป็นรอบสุดท้าย"
//         }
//     };

//     YuriActionImageTalk = {
//         // วันที่ 1
//         {
//            V10,
//            V15,
//            V12
//         },

//         // วันที่ 2
//         {
//             V11,
//             V3,
//             V7
//         },

//         // วันที่ 3
//         {
//             V20,
//             V21,
//             V13
//         },

//         // วันที่ 4
//         {
//             V9,
//             V18,
//             V13
//         },

//         // วันที่ 5
//         {
//             V18,
//             V4,
//             V22
//         },

//         // วันที่ 6
//         {
//             V6,
//             V3,
//             V18
//         },

//         // วันที่ 7
//         {
//             V18,
//             V16,
//             V2
//         }
//     };

//     userTalk = {
//         // วันที่ 1
//         {
//             "คุณ : สวัสดี! เธอชื่ออะไรหรอ",
//             "คุณ : เคยเจอกันมาก่อนไหม",
//             "คุณ : ยินดีที่ได้อยู่จักอีกรอบน่ะ"
//         },

//         // วันที่ 2
//         {
//             "คุณ : สงสัยอย่างหนึ่ง ทำไมถึงมาอยู่ในคุกนี้ได้ล่ะ",
//             "Yuri :แถมบอกว่ามีเหล้าให้ในคุกแค่นั้นก็เพียงพอแล้ว-3-",
//             "คุณ : เธอนี้แปลกดีเหมือนกันไว้ชวนไปบางขวานน่ะ"
//         },

//         // วันที่ 3
//         {
//             "ทำไมมีกลิ่นเหล้าแปลกๆแถวนี้",
//             "คุณ : นี่เธอแอบไปดื่มเหล้ามาใช่ไหม",
//             "คุณ : ถ้าว่างเดี่ยวซื้อของฝากมาให้เจอกัน",
//         },

//         // วันที่ 4
//         {
//             "Zzzzzzzzz",
//             "คุณพยายามเข้าไปดูใกล้ ทันใดนั้น Yuri ก็ตื่นขึ้นพร้อมกับสีหน้าที่ตกใจแล้วถามว่า",
//             "แต่ดูยังไง Yuri เหมือนจะมีอะไรจะบอกสักอย่างเลยแฮะ"
//         },

//         // วันที่ 5
//         {
//             "คุณ : ฉันมาแล้วจร้า",
//             "คุณ : จัดมาดิ",
//             "Yuri :แต่นั้นก็เป็นความทรงจำที่ดีน่ะ(Yuri ยิ้มให้คุณก่อนที่คุณจะกลับไปนอน)"
//         },

//         // วันที่ 6
//         {
//             "ตอนคุณมาถึงหน้าห้อง Yuri เธอได้เปลี่ยนสีหน้าเป็นดีใจอย่างเห็นได้ชัด",
//             "คุณ : ทำไมวันนี้เธอดูเศร้าจังก่อนที่ฉันจะมา",
//             "คุณ : จงเชื่อในลิขิตของสวรรค์"
//         },

//         // วันที่ 7
//         {
//             "คุณได้เดินไปหา Yuri อีกครั้ง",
//             "คุณ : เธอยังมีสิ่งที่อยากทำอยู่ไหม",
//             "ในใจคุณคิด เทพลมน่ะหรอ รอดูเลย"
//         }
//     };

//     YuriQuestions = {
//         // วันที่ 1
//         {
//             "Yuri :เธอลองเดาซิว่าเจอกันครั้งแรกที่ไหน",
//             "Yuri :ตอนไป เครื่องเล่นดนตรีเราคืออะไรล่ะ",
//             "Yuri :งั้นหรอเธอรู้จักเพื่อนฉันไหม รู้ไหมเข้าชื่ออะไร"
//         },

//         // วันที่ 2
//         {   "Yuri :ว่าแต่นายเนี่ยถามชื่อฉันเมื่อวาน แล้วนายชื่อว่าอะไร",
//             "Yuri :จะชื่ออะไรก็ขอเรียกว่าผู้คุมก็แล้วกัน ทำไมนายถึงมาเป็นผู้คุมล่ะ",
//             "Yuri :อืม....งั้นชอบกินเหล้าไหมล่ะ"
//         },

//         // วันที่ 3
//         {
//             "Yuri :งั้นในทายซิว่าได้เหล้ามาจากไหน",
//             "Yuri :งั้นถามนายบ้างล่ะชอบตัวละครแบบไหน",
//             "Yuri :นายนี่ไม่เบาเลยน่ะ นายมีแฟนยัง"
//         },

//         // วันที่ 4
//         {
//             "Yuri :นายมาตอนไหนเนี่ย",
//             "คุณสังเกตเห็นหน้าของ Yuri ดูแดง คุณเลยถาม ",
//             "Yuri :ถ้ามาคราวหน้าคราวหลังก็บอกด้วยเซ่"
//         },

//         // วันที่ 5
//         {
//             "Yuri :ร่างในปัจจุบันที่นายเห็นอยู่ตรงหน้าคล้ายกับใคร",
//             "Yuri :ต่อไป ชื่อจริ่งของฉันชื่ออะไร",
//             "Yuri :คำถามสุดท้าย เราเป็นเพศอะไร"
//         },

//         // วันที่ 6
//         {
//             "Yuri กลับไปเป็นหน้าเศร้าหมองอีกครั้ง",
//             "Yuri :ไม่ใช่เรื่องอะไรทั้งนั้นแหละ แค่คิดว่าพรุ่งนี้คงเป็นวันสุดท้ายแล้วสิน่ะ",
//             "Yuri :ถ้าเราโดนพิพากษา ประหารชีวิตเธอจะทำยังไง"
//         },

//         // วันที่ 7
//         {
//             "Yuri :ฉันขอให้ทำอะไรเพื่อฉันหน่อยก่อนจากไปไหม",
//             "Yuri :และก่อนที่จากลา นายชอบฉันไหม",
//             "Yuri :ไม่ว่ายังไงก็ขอบคุณน่ะที่ดูแลฉันมาตั้ง 7 วันน่ะ"
//         }
//     };

//     YuriQusImageTalk = {
//         // วันที่ 1
//         {
//             V10,
//             V16,
//             V12
//         },

//         // วันที่ 2
//         {   V12,
//             V8,
//             V12
//         },

//         // วันที่ 3
//         {
//             V7,
//             V19,
//             V7
//         },

//         // วันที่ 4
//         {
//             V13,
//             V13,
//             V21
//         },

//         // วันที่ 5
//         {
//             V2,
//             V2,
//             V22
//         },

//         // วันที่ 6
//         {
//             V16,
//             V2,
//             V22
//         },

//         // วันที่ 7
//         {
//              V2,
//              V7,
//              V22
//         }
//     };

//     userAnswers = {
//         // วันที่ 1
//         {
//             // คำถามที่ 1
//             {
//                 "Mondstadt",
//                 "Liyue Harbor",
//                 "Inazuma"
//             },

//             {
//                 "gitar",
//                 "piano",
//                 "Lyre"
//             },

//             {
//                 "Barbatos",
//                 "Decarabian",
//                 "Furina"
//             }

//         },

//         // วันที่ 2
//         {
//             {
//                 "Lumine",
//                 "Aether",
//                 "ฉันไม่บอกหรอก"
//             },

//             {
//                 "Neuvillette สั่งมาน่ะ",
//                 "ชั้นอยากมาเจอเธอน่ะสิ",
//                 "ฉันเป็นมนุษย์เงินเดือน"
//             },

//             {
//                 "ไม่อ่ะ",
//                 "ถ้าฟรีก็เอา",
//                 "ชอบมาเลย"
//             }
//         },

//         // วันที่ 3
//         {
//             {
//                 "Jean",
//                 "Klee",
//                 "Diluc"
//             },

//             {
//                 "หล่อเท่ห์ เห็นแล้วใจเกเร",
//                 "สวย เบิ้มๆคือลือน่ะ",
//                 "น่ารัก ขี้เล่น มีเสน่ห์"
//             },

//             {
//                 "มีแล้ว ว้ายเธอไม่มี",
//                 "ยังไม่มีเลย T-T",
//                 "มีแค่คนคุยอะ",
//             }
//         },

//         // วันที่ 4
//         {
//             {
//                 "มาปลุกไง",
//                 "มาดูรูปที่วางอยู่ใกล้ๆหน้าเธอไง",
//                 "อยากมาดูหน้าเธอไง"
//             },

//             {
//                 "เป็นไข้หรอ",
//                 "อุ้ย เขินหรอ",
//                 "เหล้าขึ้นหน้าแน่ๆ 555"
//             },

//             {
//                 "ขอโทดๆ",
//                 "ราวหน้าจะมาลักหลับน่ะ",
//                 "ไม่รู้ๆๆๆๆๆ"
//             }
//         },

//         // วันที่ 5
//         {
//             {
//                 "Vennessa วีรชนผู้ยิ่งใหญ่",
//                 "เทพอสูรแห่งพายุ Decarabian",
//                 "Florentino มหาเทพแห่งการร่ายรำ"
//             },

//             {
//                 "Annette สาวน้อยเวทลม",
//                 "Barbatos แห่งเทพลม",
//                 "Yuri เทพขี้เมา"
//             },

//             {
//                 "ชาย",
//                 "หญิง",
//                 "ไม่มีเพศ แค่น่ารักก็พอแล้วป่ะ"
//             }
//         },

//         // วันที่ 6
//         {
//             {
//                 "มีอะไรก็เล่าให้ฟังก็ได้น่ะ",
//                 "หิวเหล้าหรอ",
//                 "หมายถึงเรื่องรูปวันก่อนหรอ"
//             },

//             {
//                 "...............",
//                 "ช่างเป็นเวลาอันแสนสั้นที่ได้ใช้รวมกับเธอ",
//                 "ฉันก็เศร้าเหมือนกันที่พรุ่งนี้เราจะอยู่ด้วยกัน"
//             },

//             {
//                 "ฉันจะเป็นคนขัดความการพิพากษาเอง",
//                 "เราจะหนีไปด้วนกัน",
//                 "มันเป็นกฏของสวรรค์ที่มิอาจหลีกเลี่ยงได้"
//             }
//         },

//         // วันที่ 7
//         {
//             {
//                 "เอาเหล้าที่แพงที่สุดให้",
//                 "ฉันจะเก็บรูปไว้ในความทรงจำนี้เอง",
//                 "...................."
//             },

//             {
//                 "ชอบสิ",
//                 "ไม่ชอบ แต่รักที่สุดเลย",
//                 "ไม่อ่ะ"
//             },

//             {
//                 "ด้วยความยินดี",
//                 "ฉันจะไปคุยกับผู่พิพากษา",
//                 "หลบหนี"
//             }
//         }

//     };
//     YuriAction = {
//         // วันแรก
//         {
//             {"Yuri :นายจำได้ด้วยหรอเนี่ยเก่งจัง งั้น","Yuri :นี่นายจำสลับกับเพื่อนฉันหรอ","Yuri :ฉันไม่ได้อยู่ inazuma สักหน่อย"},
//             {"Yuri :อะไรคือ gitar -_-","Yuri :อะไรคือ  piano  ชื่อแปลกจัง","Yuri :ผู้คุมนี้อยู่จักเราด้วยแฮะ"},
//             {"Yuri :555 อันนี้เป็นนามแฝงของฉันเอง", "Yuri :ใช่แล้ว หมอนั้นเป็นมังกรวายุที่อยู่กับฉัน", "Yuri :เทพน้ำหรอ แค่รู้จักแต่ไม่สนิทมากอ่ะ"}
//         },

//         // วันที่สอง
//         {
//             {"Yuri :เป็นชื่อที่น่ารักจังน่ะ", "Yuri :เป็นชื่อที่เท่ห์ดี", "Yuri :จองหองจัง-^-"},
//             {"Yuri :คงเป็นเควสหลักสิน่ะ", "หน้าของ Yuri  แดงขึ้นมาทันที","Yuri :Mora ขาดหรอช่วงนี้ ช่างเถอะ"},
//             {"Yuri :ลองหัดดื่มเหล้าสิ 555", "Yuri :ได้ซิเดี่ยวฉันเลี้ยงเอง", "Yuri :ใจตรงกันนิ"}
//         },

//         // วันที่สาม
//         {
//             {"Yuri :เป็นไปไม่ได้ที่จะให้เหล้าฉัน", "Yuri :คุกนี้น่าจะถล่มมามากกว่าน่ะ", "Yuri :ช่ายแล้ว คนนี้แหละชงเก่งสุดเลย"},
//             {"Yuri :รสนิยมโครตแปลก", "Yuri :นายนี่เหมือนผู้ชายปกติเลยนิ","Yuri :งั้นหรอเนี่ยดีใจจัง"},
//             {"Yuri :หยอกแรงเหมือนกันน่ะเนี่ย","Yuri :ฉันก็เหมือนกันน่ะ", "Yuri :อืม....น่าสนใจ"}
//         },

//         // วันที่สี่
//         {
//             {"Yuri :อ่อหรอ.................", "Yuri :.............", "Yuri :หาาาาาา............."},
//             {"Yuri :เปล่าหรอก...ฮึ่ม", "Yuri :อย่ามากพูดบ้าๆ..ฮึ่ย", "Yuri :สัสเอ้ย....555"},
//             {"Yuri :ไม่เป็นไร แต่ก็น่ะ", "Yuri :โรคจิต ", "Yuri  :ช่างเถอะ"}
//         },

//         // วันที่ห้า
//         {
//             {"Yuri :ถูกแล้ว", "Yuri :หมอนั้นเป็นมังกรน่ะ 555 ไม่ใชาหรอก", "Yuri :ใครครับเนี่ย555"},
//             {"Yuri :ติดเกมหรอเนี่ย ไม่ใช่หรอก", "Yuri :ถูก", "Yuri :อันนั้นแค่สมที่ทุกคนคิดแบบนั้ฮึ่ม"},
//             {"Yuri :ก็ใช่น่ะ แต่ไม่ถูกเสมอไป", "Yuri :ฉันน่ารักขนาดนั้นเลยหรอ", "Yuri  :พูดมาก็ถูกต้อง"}
//         },

//         // วันที่หก
//         {
//             {"Yuri :ก็น่ะ", "Yuri :คิดว่าฉันเป็นขี้เหล้ามากหรือไงห่ะ", "Yuri :ไม่ใช่หรอก"},
//             {"Yuri :..................","Yuri :ฉันก็คิดอยู่เหมือนกัน", "หน้าของ Yuri กลับไปเศร้าและถามว่า"},
//             {"Yuri :งั้นหรอฝากด้วยน่ะ","Yuri :พูดจริงอ่ะ", "Yuri :งั้นสิน่ะ"}
//         },

//         // วันที่เจ็ด
//         {
//             {"Yuri :นั้นคงเป็นความทรงจำที่ดีที่จได้ดื่มด้วยกัน", "Yuri :ขอบใจน่ะที่นายยังเก็บชั้นในความทรงจำ", "Yuri :อย่าเงียบซิฉันก็เศร้าน่ะ"},
//             {"Yuri :ฉันก็ชอบนายน่ะ", "Yuri ได้ดึงคุณเข้าไปจูบกะทันหันก็ที่จะพูดออก", "Yuri :.............................."},
//             {"Yuri :เช่นกัน","คุณได้ ending เคลียร์ใจ", "คุณได้ ending  escape"}
//         }
//     };
//     ActionImage = {
//         // วันแรก
//         {
//             {V11,V11,V1},
//             {V19,V19,V11},
//             {V11,V4,V4}
//         },

//         // วันที่สอง
//         {
//             {V11,V11,V1},
//             {V3,V13,V4},
//             {V4,V11,V11}
//         },

//         // วันที่สาม
//         {
//             {V15,V4,V11},
//             {V4,V4,V22},
//             {V5,V4, V11}
//         },

//         // วันที่สี่
//         {
//             {V3,V6,V21},
//             {V5,V21,V5},
//             {V22,V21,V1}
//         },

//         // วันที่ห้า
//         {
//             {V22,V4,V4},
//             {V14,V22,V5},
//             {V3,V3,V20}
//         },

//         // วันที่หก
//         {
//             {V11,V5,V3},
//             {V6,V3,V16},
//             {V8,V20,V3}
//         },

//         // วันที่เจ็ด
//         {
//             {V22,V20,V15},
//             {V20,V18,V2},
//             {V2,V8, V18}
//         }
//     };
//     actionRelation = {
//         // วันแรก
//         {
//             {5, 0, 0},
//             {0, 0, 5},
//             {2, 5, 2}
//         },
//         // วันที่สอง
//         {
//             {0, 0, 5},
//             {5, 5, 4},
//             {-2, 0, 5}
//         },
//         // วันที่สาม
//         {
//             {0, -2, 5},
//             {0, 0, 5},
//             {-5, 5, 2}
//         },
//         // วันที่สี่
//         {
//             {2, 3, 5},
//             {3, 5, -5},
//             {5, -5, 2}
//         },
//         // วันที่ห้า
//         {
//             {5, 0, 0},
//             {0, 5, 3},
//             {2, 2, 5}
//         },
//         // วันที่หก
//         {
//             {5, -5, 4},
//             {0, 5, 4},
//             {5, 5, 3}
//         },
//         // วันที่เจ็ด
//         {
//             {3, 5, 1},
//             {3, 5, 0},
//             {3, 200, 500}
//         }
//     };
//     Ending = {
//         "แย่ คุณทำใจยอมรับเรื่องราวที่เกิดขึ้นตรงหน้า",
//         "ดี คุณก่อความวุ่นวายในคุกและพาเวนดิหนีไป",
//         "ดีมาก คุณหนีไปพร้อมกับเวนดิ"
//     };
// }