#pragma once

#include "../initGame.h"

class Nahida{
    vector<string> endingScreenFile;
public:
    Nahida();
    vector<string> Ending;
    vector<Texture> endScreen;
    vector<vector<string>> NahidaTalk, userTalk, NahidaQuestions;
    vector<vector<vector<string>>> userAnswers, NahidaAction;
    vector<vector<vector<int>>> actionRelation;
    vector<vector<vector<Texture>>> ActionImage;
    vector<vector<Texture>>  NahidaActionImageTalk, NahidaQusImageTalk;
    Texture N1;
    Texture N2;
    Texture N3;
    Texture N4; 
    Texture N5;
    Texture N6;
    Texture N7;
    Texture N8;
    Texture N9;
    
};


Nahida::Nahida(){
    
    // ภาพตัวแทนตัวละคร Nahida
    N1.loadFromFile("../GG_Game/charecter/Nahida/Nahidaangry.PNG");
    N2.loadFromFile("../GG_Game/charecter/Nahida/Nahidaannoy.PNG");
    N3.loadFromFile("../GG_Game/charecter/Nahida/Nahidabadmood.PNG");
    N4.loadFromFile("../GG_Game/charecter/Nahida/Nahidaconfuse.PNG");
    N5.loadFromFile("../GG_Game/charecter/Nahida/Nahidacry.PNG");
    N6.loadFromFile("../GG_Game/charecter/Nahida/Nahidanormal.PNG");
    N7.loadFromFile("../GG_Game/charecter/Nahida/Nahidasleep.PNG");
    N8.loadFromFile("../GG_Game/charecter/Nahida/Nahidasmile.PNG");
    N9.loadFromFile("../GG_Game/charecter/Nahida/Nahidaverysmile.PNG");


    endingScreenFile = {"../GG_Game/image/background/Nahidafinal1.PNG", 
                        "../GG_Game/image/background/Nahidafinal2.PNG",
                        "../GG_Game/image/background/Nahidafinal3.PNG"
                    };

    endScreen.resize(endingScreenFile.size());
    
    for (i = 0; i < 3; i++){
        endScreen[i].loadFromFile(endingScreenFile[i]);
    }    
   
    nahidaTalk = {

        // วันที่ 1
        {
            ".............................",
            "nahida : สวัสดีจ้า ฉันชื่อ nahida ",
            "nahida :ได้เลย! ยินดีที่ได้รู้จักนะ"
        },

        // วันที่ 2
        {
            "nahida :อรุณสวัสดิ์ เจอกันอีกแล้วนะ",
            "nahida :เธอมีความฝันว่าอยากจะไปเที่ยวที่ไหนบ้างไหม?",
            "nahida :ฉันอยากไปเที่ยวต่างประเทศบ้างน่ะ "
        },

        // วันที่ 3
        {
            "nahida :มาเช้าจัง...",
            "nahida :ขอโทษนะพอดีว่ามีปัญหานิดหน่อย",
            "nahida :ฉันไม่โอเค วันนี้ฉันต้องไปรับการพิพากษาน่ะสิTT"
        },

        // วันที่ 4
        {
            "เมื่อคุณมาถึงพบว่า nahida กำลังร้องไห้เพราะเธอถูกตัดสินประหารชีวิต",
            "nahida : สวัสดี มาแล้วหรอ?",
            "nahida : ประเทศที่ฉันอยากไปน่ะคือประเทศออสเตรเลีย"
        },

        // วันที่ 5
        {
            "วันนี้คุณได้มาเจอกันเพื่อคุยกันตามปกติ",
            "nahida : ถ้าให้ฉันทาย ฉันขอทายว่าประเทศฝรั่งเศส",
            "nahida :ฉันเก่งยังไงล่ะ"
        },

        // วันที่ 6
        {
            "วันนี้ nahida หน้าตาดูเศร้าหมอง",
            "nahida : เมื่อคืนฉันไม่อยากนอนเลย",
            "nahida : ฉันนึกว่าเธอจะไม่มาหาฉันแล้ว"
        },

        // วันที่ 7
        {
            "วันนี้เป็นวันที่ nahida โดนประหาร",
            "nahida : วันนี้เป็นวันสุดท้ายที่เธอจะได้เจอฉันแล้วนะ",
            "nahida : ยินดีที่ได้รู้จักนะ"
        }
    };
    NahidaActionImageTalk = {
        // วันที่ 1
        {
           S6,
           S4,
           S4
        },

        // วันที่ 2
        {
            S5,
            S5,
            S6
        },

        // วันที่ 3
        {
            S4,
            S5,
            S4
        },

        // วันที่ 4
        {
            S5,
            S4,
            S6
        },

        // วันที่ 5
        {
            S2,
            S1,
            S5
        },

        // วันที่ 6
        {
            S2,
            S6,
            S4
        },

        // วันที่ 7
        {
            S2,
            S4,
            S4
        }
    };
    userTalk = {
        // วันที่ 1
        {
            "คุณ : เงยหน้าขึ้นมา",
            "คุณ : จะร้องไห้ทำไม",
            "คุณ : ไว้เจอกันนะ หึหึ "
        },

    
        
        // วันที่ 2
        {
            "คุณ : ตื่นแล้วหรอ ",
            "คุณ : ฉันแค่เป็นห่วงเธอ",
            "คุณ : เธอไม่ต้องขอบคุณฉันหรอก ยังไงฉันก็ต้องดูแลเธออยู่แล้ว"
        },
        
        // วันที่ 3
        {
            "คุณ : เธอพร้อมหรือยัง ไม่ต้องกลัวนะ",
            "คุณ : เธอจะเดินไปดีๆ หรือจะให้ฉันลากเธอไป",
            "คุณ : นั่นสินะ ",
        },
        
        // วันที่ 4
        {   
            "//คุณเดินเข้าไปใกล้ๆซากุระ คุณเห็นซากุระนอนร้องไห้เพราะซากุระจะถูกประหาร\nในอีก3วันข้างหน้า",
            "คุณรู้สึกว่า คุณอยากเข้าไปกุมมือของซากุระไว้เพราะดูเหมือนเขาจะกลัวมาก ",
            "ฉันอยากมาเจอเธอทุกวันเลย"
        },
        
        // วันที่ 5
        {   
            "คุณ : วันนี้เป็นยังไงบ้าง ขอโทษที่ฉันมาช้า",
            "คุณ : ทำไมต้องปากแข็งด้วย หึหึ",
            "//คุณมองซากุระแล้วยิ้ม พร้อมกับเดินจากไป"
        },
        
        // วันที่ 6
        {
            "คุณ : ฉันขอโทษที่มาช้า วันนี้ฉันมีสิ่งที่ต้องทำเยอะเลย",
            "คุณ : ฉันมีบางอย่างจะให้เธอ ฉันไม่อยากให้เธอเศร้า (คุณยื่นดอกคามิเลียสีขาวให้กับซากุระ) ",
            "คุณ : อะไรจะเกิดมันก็ต้องเกิดแหละ พักผ่อนเถอะ "
        },
        
        // วันที่ 7
        {   
            "ฉันจะอยู่ข้างๆเธอจนถึงวินาทีสุดท้าย",
            "คุณ : ชีวิตของเรา อะไรมันก็ไม่แน่นอนหรอกนะ ",
            "คุณเดินเข้าไปกอดซากุระ"
        }
    };

    NahidaQuestions = {
        // วันที่ 1
        {   
            "Nahida : // ก้มหน้า ",
            "Nahida : ไอ้นี่คือใครวะเนี่ย (พูดในใจ)",
            "Nahida : คือ...เรา..."
        },
        
        // วันที่ 2
        {   "Nahida : คุณใจดีจัง ",
            "Nahida :พรุ่งนี้ฉันได้รับพิพากษาแล้วสินะ",
            "Nahida ://ซากุระหน้ามืดคล้ายจะเป็นลม คุณเดินเข้าไปใกล้ซากุระ จากนั้นซากุระถามคุณว่า\n คุณจะพาฉันไปไหน "
        },
        
        // วันที่ 3
        { 
            "Nahida :โอ๊ยย //ซากุะร้องเสียงดัง หลังจากที่คุณดึงแขนซากุระขึ้นมา ",
            "Nahida :เห้อ น่าเบื่อจริงๆเลย ",
            "//ตอนนี้คุณกำลังพาซากุระกลับไปที่ห้องขัง คุณเห็นแสงดวงอาทิตย์ตอนเย็นพาดผ่านริมหน้าต่าง\n แสงตกกระทบกับแววตาของซากุระ คุณเลือกที่จะ..."
        },
        
        // วันที่ 4
        {
            "//ซากุระสบตากับคุณ และคุณก็สบตากับซากุระ ",
            "Nahida :คุณอยากรู้ความจริงไหนว่าทำไมฉันถึงมาอยู่ที่นี่",
            "Nahida :วันนี้อากาศดีจัง ฉันอยากไปเดินเล่น"
        },
        
        // วันที่ 5
        {   
            "//คุณมองรอบๆ เพื่อให้แน่ใจว่าไม่มีคนอื่น เพราะคุณตั้งใจที่จะ ...",
            "Nahida : ฉันหิว ",
            "Nahida :ฉันหวังว่าเราจะได้เจอกันในอีกซักวัน"
        },
        
        // วันที่ 6
        {   

            "Nahida : คุณรู้ได้ยังไงว่าฉันชอบดอกคามิเลียสีขาว ",
            "Nahida : แต่ก็...ขอบคุณนะ... แค่คุณอยู่ตรงนี้ฉันก็มีความสุขมากๆแล้ว ",
            "Nahida : ทำไม คุณถึงใจดีกับฉันขนาดนี้ ... "
                 
    
        },
        
        // วันที่ 7
        {   
            "Nahida :คุณมีอะไรจะบอกฉัน ก่อนที่เราจะจากกันไหม",
            "Nahida :คุณรักฉันไหม",
            "Nahida :นี่!!! คุณกำลังจะทำอะไรน่ะ"
        },
    };

     NahidaQusImageTalk = {
        // วันที่ 1
        {
            S5,
            S1,
            S2
        },

        // วันที่ 2
        {   S3,
            S4,
            S1
        },

        // วันที่ 3
        {
            S2,
            S1,
            S6
        },

        // วันที่ 4
        {
            S5,
            S6,
            S6
        },

        // วันที่ 5
        {
            S6,
            S2,
            S6
        },

        // วันที่ 6
        {
            S6,
            S6,
            S6
        },

        // วันที่ 7
        {
             S4,
             S3,
             S2
        }
    };


    userAnswers = {
        // วันที่ 1
        {
            // คำถามที่ 1
            {
                "คุณคิดในใจว่า เขาน่ารักมากๆ ", 
                "สบตาฉันสิ", 
                "ไปแก้มัดให้มัน !!!"
            },

            {
                "ไม่ต้องกลัวฉันนะ...", 
                "เธอคิดอะไรอยู่", 
                "//มองหน้า ซากุระ "
            },

            {
                "ฉันจะอยู่ข้างๆเธอ", 
                "วันนี้พักผ่อนเถอะ", 
                "รีบพูดก่อนที่จะไม่ได้พูด หึหึ "
            }

        },

        // วันที่ 2              
        {
            {
                "//คุณเปิดประตูห้องขัง และจากนั้น คุณเดินเข้าไปใกล้ๆซากุระ", 
                "//คุณมองซากุระแล้วยิ้มให้", 
                "//คุณยื่นขนมให้กับซากุระ"
            },

            {
                "อืม ฉันจะคอยดูแลเธอเอง", 
                "เธอไปทำอะไรมา ถึงได้มาอยู่ที่นี่", 
                "ใช่แล้ว แต่ไม่ต้องกลัวหรอกนะ" 
            },

            {
                "อยู่เฉยๆเถอะ ", 
                "ไปหาหมอ ถ้าเธอตายฉันคงโดนหักเงินเดือนแน่ๆ", 
                "//คุณเลือกที่จะไม่ตอบอะไร และคุณอุ้มซากุระไปหาหมอ" 
            }
        },

        // วันที่ 3
        {
            {
                "ถ้าฉันไม่ทำแบบนี้เธอจะลุกขึ้นเองไหม !!", 
                "หรือเธอจะให้ฉันต้องอุ้มเธอไปห๊ะาา",
                "//คุณเลือกที่จะเงียบและแบกร่างบางพาดไหล่" 
            },

            {
                "ใจเย็นๆสิ เธอแค่หิว", 
                "อีกสักพักจะได้กลับแล้ว ฮึบๆ", 
                "แล้วเธอคิดว่าฉันไม่เบื่อบ้างหรอ"
            },

            {
                "ดึงซากุระเข้ามากอด", 
                "บังแสงแดดให้", 
                "คุณเลือกที่จะเก็บความรู้สึกเอาไว้เพราะคุณกลัวความผูกพันธ์", 
            }
        },

        // วันที่ 4
        {
            {
                "คุณกอดซากุระและลูบหัวซากุระ",
                "คุณมอบจูบที่แสนอบอุ่นให้กับซากุระ", 
                "คุณกุมมือเล็กๆซากุระ" 
            },
            
            {
                "ถ้าเธออยากเล่าให้ฉันฟัง ฉันพร้อมเสมอนะ", 
                "จริงๆฉันรู้อยู่แล้วน่ะ", 
                "ทำไม...???" 
            },

            {
                "งั้นเราไปเดินเล่นกันไหม", 
                "วันนี้ดึกแล้ว เธอกลับไปพักผ่อนเถอะ", 
                "แย่จัง วันนี้ฉันต้องไปแล้ว ไว้เราไปกันวันหลังนะ" 
            }   
        },

        // วันที่ 5
        {
            {
                "เข้าไปนอนกอดซากุระ", 
                "ปล่อยซากุระให้หนีไป", 
                "เข้าไปนั่งคุยกับซากุระในห้องขัง ... " 
            }, 
            
            {
                "เราออกไปล่าสัตว์มากินไหม", 
                "งั้นรอแปปนึงนะ เดี๋ยวฉันไปหาอะไรให้ทาน", 
                "ถ้าเธอทำตัวเป็นเด็กดีิฉันจะพาเธออกไปกินข้าว"  
            },

            {
                "แน่นอนสิ",  
                "เหตุผลที่ฉันอยากตื่นมาทุกเช้า เพราะฉันอยากเจอเธอ",  
                "ฉันอยู่ในใจของเธอเสมอ " 
            }
        },


        // วันที่ 6
        {
            {  
                
                "เพราะเธอเคยละเมอพูดว่าอยากไปเดินเล่นในทุ่งดอกไม้ใต้ท้องฟ้าสีคราม\n แต่ตอนนี้ฉันพาเธออกไปไม่ได้ ขอโทษนะ..", 
                "เพราะไม่มีอะไรที่ฉันไม่รู้น่ะสิ หึหึ", 
                "ฉันไม่รู้หรอก แต่ฉันคิดว่า มันเหมาะกับเธอมากๆเลย" 
            },
            
            {
                "ฉันอยากใช้เวลากับเธอให้นานกว่านี้", 
                "ฉันก็รู้สึกแบบนั้นเหมือนกัน", 
                "ฉันจะทำทุกอย่างที่ทำให้เราจะได้อยู่ด้วยกัน" 
            },

            {
                "เธอเชื่อในเรื่องของรักแรกพบไหม??",
                "ก็ป่าวหนิ",
                "เธอไม่รู้จริงๆหรอว่าฉันรู้สึกยังไงอยู่" 
            }
            
        },

        // วันที่ 7
        {       
            {
                "ฉัน...อยากช่วยเธอแหกคุก เธอไม่ได้ทำอะไรผิดเลย", 
                "ถ้าจะหนี ก็รีบหนี อย่าให้โดนจับได้",
                "เราหนีไปด้วยกันไหม" 
            },
            
            {
                "ฉันรู้สึกตกหลุมรักเธอตั้งแต่ครั้งแรกที่เราได้พบกัน",
                "ก็ป่าวหนิ",
                "ถ้าฉันไม่รักเธอ ฉันคงไม่รู้สึกเสียใจขนาดนี้" 
            },

            {
                "//คุณดึงซากุระเข้ามากอด", 
                "//คุณถอดเสื้อคลุมของตัวเอง แล้วเอามาคลุมไหล่ให้กับตัวเล็กของคุณ", 
                "//คุณคุกเข่าลงพร้อมกับจุมพิตที่มือของซากุระ" 
            }
        }


    };
    NahidaAction = {
        // วันแรก
        {
            {"Nahida :ฉันรู้อยู่แล้วแหละน่า!!","Nahida : (;´༎ຶٹ༎ຶ`)","Nahida : ขอบคุณนะ "},
            {"Nahida :อือ ... ","Nahida :ฉันอยากกลับบ้านจัง ","Nahida : เขิน "},
            {"Nahida :ขอบคุณนะ", "Nahida :อยู่คุยกันก่อนสิ ", "Nahida : ฉันไม่ได้อยากพูดกับเธอหรอกนะ "}
        },
        
        // วันที่สอง
        {
            {"Nahida : ༼ ༎ຶ ෴ ༎ຶ༽ ม่ายน้าา าา าาาาา ", "Nahida : อะไรของเค้า ಠ╭╮ಠ  ", "Nahida : รับขนมพร้อมกับยิ้มให้  "},
            {"Nahida : ทำให้ได้อย่างที่พูดเถอะ ", "เธอจะรู้ไปทำไม ความลับน่ะ","Nahida : ฉันเคยกลัวด้วยหรอ หึหึ (จริงๆกลัวแต่ไม่พูด)"},
            {"Nahida : ฉันทำเวรกรรมอะไรไว้ถึงได้มาเจออิตานี่!", "Nahida : //ฮึ่มมม ช่วยฉันเพราะแบบนี้เองสินะ", "Nahida : //ซากุระเงียบ..."}
        },
        
        // วันที่สาม
        {
            {"Nahida : ก็ฉันขี้เกียจตัวเป็นขนน่ะสิ", "Nahida :  ฉันตัวหนักมากเดี๋ยวก็แขนหักหรอก ฮ่าๆ", "Nahida : เห้อ จะทำอะไรก็ทำเถอะ"},
            {"Nahida : เธอช่างรู้ใจฉันจริงๆ", "Nahida : อือ","Nahida :  ก็ฉันบอกว่าฉันเบื่อ เธอจะทำไมห๊าา"},
            {"Nahida : ซากุระทำหน้าเหมือนลูกแมวตัวน้อยที่อยู่ในอ้อมกอดของคุณ","Nahida : ซากุระหอมแก้มคุณ", "Nahida : คุณและซากุระได้เดินกลับห้องขังท่ามกลางแสงแดดที่อบอุ่น"}
        },
        
        // วันที่สี่
        {
            {"ตอนนี้ซากุระเหมือนกับลูกหมาตัวเล็กๆในอ้อมกอดของคุณ", "ซากุระจูบคุณกลับด้วยความเร่าร้อน", "ฉันอยากหยุดช่วงเวลาตอนนี้ที่ได้อยู่กับเธอเอาไว้"},
            {"Nahida :เพราะฉันโดนใส่ร้ายว่าเป็นฆาตกร ทั้งๆที่ฉันยังไม่ได้ทำอะไรผิดเลย\n แต่คนอื่นกลับเชื่อว่าฉันฆ่าคน ", "Nahida :อย่าปากแข็งได้ไหม ถ้าอยากรู้ ก็บอกว่าอยากรู้สิ", "Nahida :เพราะฉันโดนใส่ร้ายว่าเป็นฆาตกร ทั้งๆที่ฉันยังไม่ได้ทำอะไรผิดเลย \nแต่คนอื่นกลับเชื่อว่าฉันฆ่าคน"},
            {"Nahida :เย้ ขอบคุณนะ (ซากุระทำตัวเหมือนหมาโกลเด้นที่ตี่กำลังตื่นเต้นที่จะได้ออกไปข้างนอก)", "Nahida :ซากุระทำหน้าหงอย", "Nahida  : ได้สิ คุณสัญญานะ..."}
        },
        
        // วันที่ห้า
        {
            {"Nahida :คุณอย่ากอดฉันแรงนักสิฉันหายใจไม่ออก", "Nahida :ฉันจะไม่หนีไปถ้าไม่มีคุณ", "Nahida :คุณจะเข้ามาทำไม เดี๋ยวคนอื่นก็เข้าใจผิดหรอก"},
            {"Nahida :เอ่อ...", "Nahida : ขอบคุณน้าเจ้าทาส", "Nahida : ก็บอกแล้วฉันน่ะเด็กดี ดื้อเป็นที่ไหนล่ะ"},
            {"Nahida :งื้ออ", "Nahida :ฮ่าๆ เธอพูดอะไรแบบนี้แล้วฉันจั๊กจี้หัวใจสุดๆเลย", "Nahida  :อุ้ย...พูดมาก็ถูกต้อง(เขิน)"}
        },
        
        // วันที่หก
        {
            {"Nahida : เธอมันโครตโรแมนติคสุดๆเลย ", "Nahida:เลิกเบียวสักวันแล้วมันจะตายไหม", "Nahida :ขอบคุณนะ"},
            {"Nahida : งั้นคุณต้องทำอะไรสักอย่างแล้วแหละนะ หึหึ","Nahida ://ซากุระเข้ามากอดคุณพร้อมกับทำตัวเหมือนลูกหมา", "ซากุระ : //ฉันจะรอดูละกัน หึหึ"},
            {"Nahida : ฉันเชื่อ ตั้งแต่ที่ฉันได้มาเจอกับคุณ ","Nahida :  เห้อออ - - ", "Nahida : จริงๆฉันก็พอจะรู้ หึหึ"}
        },
        
        // วันที่เจ็ด
        {
            {"Nahida : งั้นเราหนีไปด้วยกันเถอะนะ", "Nahida : ฉันไม่อยากไปคนเดียว... ", "Nahida : น่าสนใจ..."},
            {"Nahida : นั่นเป็นเพราะพรหมลิขิตสินะ","Nahida : เลิกปากแข็งสักที ชั้นจะโดนประหารอยู่แล้วนะ","Nahida : เธออย่าพูดแบบนี้สิ ฉันก็เศร้าเหมือนกันนะ"},
            {"Nahida :ซากุระได้เอาหัวมาซบกับไหล่กว้างๆของคุณ","ซากุระรู้สึกอบอุ่นและมีความสุข", "ซากุระกำลังตกใจกับการกระทำของคุณ"}
        }
    };

    ActionImage = {
        // วันแรก
        {
            {S1,S5,S6},
            {S6,S4,S3},
            {S3,S4,S1}
        },

        // วันที่สอง
        {
            {S4,S1,S6},
            {S1,S1,S1},
            {S2,S2,S2}
        },

        // วันที่สาม
        {
            {S5,S2,S1},
            {S6,S2,S1},
            {S3,S3,S6}
        },

        // วันที่สี่
        {
            {S3,S3,S3},
            {S4,S1,S6},
            {S3,S2,S4}
        },

        // วันที่ห้า
        {
            {S3,S4,S5},
            {S2,S6,S1},
            {S3,S1,S1}
        },

        // วันที่หก
        {
            {S3,S1,S6},
            {S6,S3,S2},
            {S3,S2,S2}
        },

        // วันที่เจ็ด
        {
            {S4,S2,S6},
            {S3,S1,S2},
            {S3,S3,S3}
        }
    };
    
    actionRelation = {
        // วันแรก
        {
            {4, 4, 3},
            {1, 1, 0},
            {2, 0, 0}
        },
        // วันที่สอง
        {
            {4, 4, 4},
            {0, 0, 0},
            {1, 2, 1}
        },
        // วันที่สาม
        {
            {1, 2, 2},
            {0, 0, 0},
            {11, 11, 2}
        },
        // วันที่สี่
        {
            {4, 4, 5},
            {0, 0, 0},
            {5, -5, -5}
        },
        // วันที่ห้า
        {
            {5, 3, 4},
            {-3, 5, 5},
            {-3, 4, 3}
        },
        // วันที่หก
        {
            {5, 0, 4},
            {4, 3, 4},
            {5, -3, 3}
        },
        // วันที่เจ็ด
        {
            {3, 5, 3},
            {3, -4, -3},
            {30, 50, -50}
        }
    };

    Ending = {
        "แย่  คุณหลอกซากุระไปฆ่า เพราะแท้จริงแล้ว คุณเป็นฆาตกรต่อเนื่องคนนั้น \nแต่คุณจัดฉากทั้งหมดให้ซากุระเป็นคนร้าย",
        "ดี คุณได้ไปคุยกับผู้คุมทำให้ซากุระได้รับพิพากษาโทษใหม่อีกครั้ง",
        "ดีมาก คุณพาซากุระหนีไปกับคุณและไปใช้ชีวิตอยู่ด้วยกันอย่างมีความสุข\nในที่ที่จะไม่มีใครหาคุณเจอ"
    };


}
