#pragma once

#include "../initGame.h"

class Nahida{
    vector<string> endingScreenFile;
public:
    Nahida();
    vector<string> Ending;
    vector<Texture> endScreen;
    vector<vector<string>> NahidaTalk, userTalk, NahidaQuestions;
    vector<vector<vector<string>>> userAnswers, NahidaAction;
    vector<vector<vector<int>>> actionRelation;
    vector<vector<vector<Texture>>> ActionImage;
    vector<vector<Texture>>  NahidaActionImageTalk, NahidaQusImageTalk;
    Texture N1;
    Texture N2;
    Texture N3;
    Texture N4; 
    Texture N5;
    Texture N6;
    Texture N7;
    Texture N8;
    Texture N9;
    
};


Nahida::Nahida(){
    
    // ภาพตัวแทนตัวละคร Nahida
    N1.loadFromFile("../GG_Game/charecter/Nahida/Nahidaangry.PNG");
    N2.loadFromFile("../GG_Game/charecter/Nahida/Nahidaannoy.PNG");
    N3.loadFromFile("../GG_Game/charecter/Nahida/Nahidabadmood.PNG");
    N4.loadFromFile("../GG_Game/charecter/Nahida/Nahidaconfuse.PNG");
    N5.loadFromFile("../GG_Game/charecter/Nahida/Nahidacry.PNG");
    N6.loadFromFile("../GG_Game/charecter/Nahida/Nahidanormal.PNG");
    N7.loadFromFile("../GG_Game/charecter/Nahida/Nahidasleep.PNG");
    N8.loadFromFile("../GG_Game/charecter/Nahida/Nahidasmile.PNG");
    N9.loadFromFile("../GG_Game/charecter/Nahida/Nahidaverysmile.PNG");


    endingScreenFile = {"../GG_Game/image/background/Nahidafinal1.png", 
                        "../GG_Game/image/background/Nahidafinal2.png",
                        "../GG_Game/image/background/Nahidafinal3.png"
                    };

    endScreen.resize(endingScreenFile.size());
    
    for (i = 0; i < 3; i++){
        endScreen[i].loadFromFile(endingScreenFile[i]);
    }    
   
    NahidaTalk = {

        // วันที่ 1
        {
            ".............................",
            "nahida : สวัสดีจ้า ฉันชื่อ nahida ",
            "nahida :ได้เลย! ยินดีที่ได้รู้จักนะ"
        },

        // วันที่ 2
        {
            "nahida :อรุณสวัสดิ์ เจอกันอีกแล้วนะ",
            "nahida :เธอมีความฝันว่าอยากจะไปเที่ยวที่ไหนบ้างไหม?",
            "nahida :ฉันอยากไปเที่ยวต่างประเทศบ้างน่ะ "
        },

        // วันที่ 3
        {
            "nahida :มาเช้าจัง...",
            "nahida :ขอโทษนะพอดีว่ามีปัญหานิดหน่อย",
            "nahida :ฉันไม่โอเค วันนี้ฉันต้องไปรับการพิพากษาน่ะสิTT"
        },

        // วันที่ 4
        {
            "เมื่อคุณมาถึงพบว่า nahida กำลังร้องไห้เพราะเธอถูกตัดสินประหารชีวิต",
            "nahida : สวัสดี มาแล้วหรอ?",
            "nahida : ประเทศที่ฉันอยากไปน่ะคือประเทศออสเตรเลีย"
        },

        // วันที่ 5
        {
            "วันนี้คุณได้มาเจอกันเพื่อคุยกันตามปกติ",
            "nahida : ถ้าให้ฉันทาย ฉันขอทายว่าประเทศฝรั่งเศส",
            "nahida :ฉันเก่งยังไงล่ะ"
        },

        // วันที่ 6
        {
            "วันนี้ nahida หน้าตาดูเศร้าหมอง",
            "nahida : เมื่อคืนฉันไม่อยากนอนเลย",
            "nahida : ฉันนึกว่าเธอจะไม่มาหาฉันแล้ว"
        },

        // วันที่ 7
        {
            "วันนี้เป็นวันที่ nahida โดนประหาร",
            "nahida : วันนี้เป็นวันสุดท้ายที่เธอจะได้เจอฉันแล้วนะ",
            "nahida : ยินดีที่ได้รู้จักนะ"
        }
    };
    // NahidaActionImageTalk = {
    //     // วันที่ 1
    //     {
    //        S6,
    //        S4,
    //        S4
    //     },

    //     // วันที่ 2
    //     {
    //         S5,
    //         S5,
    //         S6
    //     },

    //     // วันที่ 3
    //     {
    //         S4,
    //         S5,
    //         S4
    //     },

    //     // วันที่ 4
    //     {
    //         S5,
    //         S4,
    //         S6
    //     },

    //     // วันที่ 5
    //     {
    //         S2,
    //         S1,
    //         S5
    //     },

    //     // วันที่ 6
    //     {
    //         S2,
    //         S6,
    //         S4
    //     },

    //     // วันที่ 7
    //     {
    //         S2,
    //         S4,
    //         S4
    //     }
    // };
    userTalk = {
        // วันที่ 1
        {
            "คุณ : สวัสดีจ้า! เธอมีชื่อว่าอะไร",
            "คุณ : ต่อจากนี้ฉันจะเรียกเธอว่า nahida นะ",
            "คุณ : ยินดีที่ได้รู้จักเช่นกันนะ"
        },

        // วันที่ 2
        {
            "คุณ : อรุณสวัสดิ์จ้า",
            "คุณ : ฉันมีความฝันว่าอยากไปเที่ยวทะเลน่ะ แล้วเธอล่ะ?",
            "คุณ : งั้นพรุ่งนี้มาเล่าประเทศที่เธออยากไปให้ฉันฟังนะ"
        },

        // วันที่ 3
        {
            "คุณ : ใช่! ฉันมารอเธอนานแล้วนะ",
            "คุณ : เธอโอเคใช่ไหม",
            "คุณ : ไม่เป็นไรนะ เธอต้องผ่านมันไปได้",
        },

        // วันที่ 4
        {
            "Zzzzzzzzz",
            "คุณไม่อยากให้ nahida ร้องไห้ คุณจึงชวนเธอคุย",
            "คุณ : มาแล้ว ไหนว่าจะเล่าประเทศที่อยากไปให้ฟังไง",
            "คุณ : น่าไปเหมือนกันนะ"
        },

        // วันที่ 5
        {
            "คุณ : เธออยากรู้มั้ยว่าประเทศที่ฉันอยากไปคือที่ไหน",
            "คุณ : ใช่เลย! เธอรู้ได้ยังไง",
            "คุณ : โอเคๆ เธอก็เก่งจริงๆนั่นแหล่ะ"
        },

        // วันที่ 6
        {
            "เมื่อคุณมาถึงหน้าห้อง nahida เธอได้เปลี่ยนสีหน้าเป็นดีใจอย่างเห็นได้ชัด",
            "คุณ : ทำไมล่ะ",
            "คุณ : ไม่เป็นไรนะ มันเป็นแค่ฝันร้าย"
        },

        // วันที่ 7
        {
            "คุณได้เดินไปคุยกับ nahida แบบจริงจัง",
            "คุณ : อื้ม ฉันจะอยู่ข้างเธอเสมอนะ",
            "คุณได้จากลากับ mahida เป็นครั้งสุดท้าย"
        }
    };

    NahidaQuestions = {
        // วันที่ 1
        {   
            "Nahida : // ก้มหน้า ",
            "Nahida : ไอ้นี่คือใครวะเนี่ย (พูดในใจ)",
            "Nahida : คือ...เรา..."
        },
        
        // วันที่ 2
        {   "Nahida : คุณใจดีจัง ",
            "Nahida :พรุ่งนี้ฉันได้รับพิพากษาแล้วสินะ",
            "Nahida ://ซากุระหน้ามืดคล้ายจะเป็นลม คุณเดินเข้าไปใกล้ซากุระ จากนั้นซากุระถามคุณว่า\n คุณจะพาฉันไปไหน "
        },
        
        // วันที่ 3
        { 
            "Nahida :โอ๊ยย //ซากุะร้องเสียงดัง หลังจากที่คุณดึงแขนซากุระขึ้นมา ",
            "Nahida :เห้อ น่าเบื่อจริงๆเลย ",
            "//ตอนนี้คุณกำลังพาซากุระกลับไปที่ห้องขัง คุณเห็นแสงดวงอาทิตย์ตอนเย็นพาดผ่านริมหน้าต่าง\n แสงตกกระทบกับแววตาของซากุระ คุณเลือกที่จะ..."
        },
        
        // วันที่ 4
        {
            "//ซากุระสบตากับคุณ และคุณก็สบตากับซากุระ ",
            "Nahida :คุณอยากรู้ความจริงไหนว่าทำไมฉันถึงมาอยู่ที่นี่",
            "Nahida :วันนี้อากาศดีจัง ฉันอยากไปเดินเล่น"
        },
        
        // วันที่ 5
        {   
            "//คุณมองรอบๆ เพื่อให้แน่ใจว่าไม่มีคนอื่น เพราะคุณตั้งใจที่จะ ...",
            "Nahida : ฉันหิว ",
            "Nahida :ฉันหวังว่าเราจะได้เจอกันในอีกซักวัน"
        },
        
        // วันที่ 6
        {   

            "Nahida : คุณรู้ได้ยังไงว่าฉันชอบดอกคามิเลียสีขาว ",
            "Nahida : แต่ก็...ขอบคุณนะ... แค่คุณอยู่ตรงนี้ฉันก็มีความสุขมากๆแล้ว ",
            "Nahida : ทำไม คุณถึงใจดีกับฉันขนาดนี้ ... "
                 
    
        },
        
        // วันที่ 7
        {
            "nahida :ก่อนจะจากกันตลอดไป เธอมีอะไรบอกฉันไหม",
            "nahida :ฉันแค่อยากแน่ใจน่ะ",
            "nahida :ขอบคุณที่ดูแลฉันมาตลอดนะ"
        }
    };

    nahidaQusImageTalk = {
        // วันที่ 1
        {
            N8,
            N8,
            N8
        },

        // วันที่ 2
        {   N9,
            N4,
            N6
        },

        // วันที่ 3
        {
            N3,
            N4,
            N9
        },

        // วันที่ 4
        {
            N4,
            N5,
            N5
        },

        // วันที่ 5
        {
            N6,
            N6,
            N9
        },

        // วันที่ 6
        {
            N3,
            N5,
            N5
        },

        // วันที่ 7
        {
             N5,
             N6,
             N9
        }
    };

    userAnswers = {
        // วันที่ 1
        {
            // คำถามที่ 1
            {
                "กีต้าร์",
                "เปียโน",
                "กลอง"
            },

            {
                "ไม่บอกหรอก",
                "ฉันเรียนมาตั้งแต่เด็กน่ะสิ",
                "ฉันอยากเท่บ้าง"
            },

            {
                "//คุณคิดว่าเธอเล่นดนตรีแล้วมีเสน่ห์มาก",
                "//คุณคิดว่าเธอเล่นดนตรีแล้วไม่เก่งเลย",
                "//คุณคิดว่าเธอเล่นดนตรีแล้วเท่สุดๆ"
            }

        },

        // วันที่ 2
        {
            {
                "ฉันอยากไป opera house น่ะ",
                "ฉันอยากไปเจอจิงโจ้",
                "ฉันไม่บอกหรอก"
            },

            {
                "Levi",
                "Travis",
                "Luna"
            },

            {
                "Neuvillette สั่งให้ฉันมาเป็นน่ะสิ",
                "ฉันโดนบังคับให้มาเป็นน่ะ",
                "ฉันไม่รู้ว่าจะทำอะไรดี"
            }
        },

        // วันที่ 3
        {
            {
                "วันนี้เธออยากนอนพักผ่อนมั้ย",
                "ไปทำอะไรมาล่ะ",
                "//คุณหายามาให้ nahida"
            },

            {
                "เธอควรพักผ่อนเยอะๆนะ",
                "อดทนไปก่อนนะ เดี๋ยวก็หาย",
                "ฉันพาเธอไปหาหมอได้นะ"
            },

            {
                "ไม่เป็นไรเลย",
                "เธอก็ดูแลตัวเองดีๆ",
                "ก็เธอไม่สบายอยู่หนิ",
            }
        },

        // วันที่ 4
        {
            {
                "บอกแล้วว่าให้พักผ่อนเยอะๆ",
                "งั้นฉันก็ต้องพาเธอไปหาหมอแล้วล่ะ",
                "หรือจะให้ฉันลากเธอไปหาหมอ"
            },

            {
                "ทำไมล่ะ เธอต้องไปหาหมอนะ",
                "ฉันต้องให้หมอมาตรวจเธอแล้วแหละ",
                "เธอจะไปดีๆมั้ยหรือจะไปด้วยน้ำตา"
            },

            {
                "หมอไม่ฉีดยาเธอหรอก",
                "ไม่เห็นน่ากลัวเลย",
                "เธอโดนหมอฉีดยาแน่"
            }
        },

        // วันที่ 5
        {
            {
                "ฉันอยากไปเห็นหอไอเฟลน่ะ",
                "ฉันชอบน้ำหอมมากเลยนะ",
                "ฉันอยากลองกินขนมปังที่ฝรั่งเศสดู"
            },

            {
                "อยากอยู่นะ",
                "อยากมากเลยล่ะ",
                "ไม่เห็นจะอยากไปเลย"
            },

            {
                "อยากสิ",
                "ไม่อยากไปหรอก",
                "ทำไมจะไม่อยากกันล่ะ"
            }
        },

        // วันที่ 6
        {
            {
                "ฉันกลัวน่ะสิ",
                "ฉันไม่ได้ทำหน้าบึ้งตึงสักหน่อย",
                "ฉันเศร้าอยู่นะTT"
            },

            {
                "ฉันไม่มาหาเธอแน่นอน",
                "ฉันต้องมาหาเธออยู่แล้ว",
                "ฉันมาหาเธอแน่นอน ฉันอยู่ข้างเธอเสมอ"
            },

            {
                "แน่นอนอยู่แล้ว",
                "ฉันจะอยู่ข้างเธอตลอดไปเลย",
                "ไม่มีทางหรอก"
            }
        },

        // วันที่ 7
        {
            {
                "ฉันอยากจะบอกว่าฉันชอบเธอ",
                "ไม่มีนะ ทำไมหรอ",
                "ฉันไม่ได้ชอบเธอ"
            },

            {
                "เธอแน่ใจได้แล้วล่ะ",
                "ฉัน",
                "ไม่อ่ะ"
            },

            {
                "ไม่เป็นไรเลย เธอสำคัญสำหรับเราที่สุด",
                "ฉันอยู่ข้างเธอตลอดไปอยู่แล้ว",
                "หลบหนี"
            }
        }

    };
   nahidaAction = {
        // วันแรก
        {
            {"nahida :ไม่ใช่อ่ะะ","nahida :ใช่แล้ว เธอเก่งมาก","nahida :ฉันเล่นไม่เป็นหรอกนะ"},
            {"nahida :ใจร้ายจัง","nahida :แม่ฉันบังคับให้เรียนน่ะสิ้","nahida :ฉันก็เท่อยู่ประมาณนึงล่ะนะ"},
            {"nahida :ฉันมีเสน่ห์เสมออยู่แล้วน่ะสิ", "nahida :ไม่จริงหรอกนะ", "nahida :เขินน้าาา"}
        },

        // วันที่สอง
        {
            {"nahida :ช่าย ฉันอยากไป opera house", "nahida :ฉันไม่อยากทะเลาะกับจิงโจ้หรอกนะ", "nahida :ทำไมถึงจะไม่อยากบอกกันนะ"},
            {"nahida :ชื่อนี้ไม่คุ้นหูเท่าไหร่นะ", "nahida :ชื่อนี้เท่ห์อยู่นี่นา ","nahida :ชื่อนี้น่ารักดีนะ"},
            {"nahida :อันนี้เป็นไปได้มากที่สุดเลยนะ", "nahida :ใจร้ายจังเลย", "nahida :จริงรึป่าวนะ"}
        },

        // วันที่สาม
        {
            {"nahida :อยากสิ", "nahida :ดุจังTT", "nahida :ไม่อยากกินยาเลย"},
            {"nahida :ฉันจะพักผ่อนเยอะๆนะ", "nahida :รู้แล้วล่ะหน่า","nahida :ไม่อยากไปเลย"},
            {"nahida :จิงหรอ","nahida :ฉันดูแลตัวเองดีอยู่แล้ว", "nahida :จริงด้วยสินะ"}
        },

        // วันที่สี่
        {
            {"nahida :ฉันพักผ่อนเยอะแล้วน้า", "nahida :ฉันไม่อยากไปหาหมออ", "nahida :ใจร้ายจังเลยยยT^T"},
            {"nahida :ก็บอกว่าไม่อยากไปหาหมอยังไงเล่า", "nahida :ไม่เอาาาา", "nahida :ใจร้ายที่สุดเลยฮือฮือ"},
            {"nahida :เป็นอย่างงั้นก็ดีสิ", "nahida :ไม่จริงง ", "nahida  :ม่ายย ฉันไม่อยากโดนฉีดยา"}
        },

        // วันที่ห้า
        {
            {"nahida :หอไอเฟลต้องสวยมากแน่ๆ", "nahida :จริงหรอ ดูไม่น่าเข้ากันเลย", "nahida :น่าอร่อยอยู่นะ"},
            {"nahida :ไปด้วยกันเถอะ", "nahida :ต้องไปด้วยกันแล้วสิอย่างงี้", "nahida :ทำไมกันหล่ะ;-;"},
            {"nahida :ไปด้วยกันมั้ยย", "nahida :ทำไมมมม", "nahida  :งั้นก็ไปด้วยกันนะ"}
        },

        // วันที่หก
        {
            {"nahida :กลัวมากเลยน่ะสิ", "nahida :ไม่จริงเลยสักนิด", "nahida :เศร้ามากจริงๆนะ"},
            {"nahida :ทำไมกันล่ะ","nahida :รีบมาหานะ", "nahida : เธอต้องอยู่ข้างฉันตลอดไปเลยนะ"},
            {"nahida :เป็นเรื่องจริงใช่มั้ย","nahida :จริงหรอ", "nahida :ร้องไห้แล้วนะฮือ"}
        },

        // วันที่เจ็ด
        {
            {"nahida :ความทรงจำที่ดีที่สุดสินะ", "nahida :ไม่มีอะไรบอกจริงหรอ แย่จัง", "nahida :ไม่ใช่เรื่องจริงหรอกนะ"},
            {"nahida :ขอบคุณนะ", "nahida :จริงใช่มั้ย", "nahida :..."},
            {"nahida :เหมือนกันเลย","คุณได้ ending เคลียร์ใจ", "คุณได้ ending escape"}
        }
    };

    // ActionImage = {
    //     // วันแรก
    //     {
    //         {S1,S5,S6},
    //         {S6,S4,S3},
    //         {S3,S4,S1}
    //     },

    //     // วันที่สอง
    //     {
    //         {S4,S1,S6},
    //         {S1,S1,S1},
    //         {S2,S2,S2}
    //     },

    //     // วันที่สาม
    //     {
    //         {S5,S2,S1},
    //         {S6,S2,S1},
    //         {S3,S3,S6}
    //     },

    //     // วันที่สี่
    //     {
    //         {S3,S3,S3},
    //         {S4,S1,S6},
    //         {S3,S2,S4}
    //     },

    //     // วันที่ห้า
    //     {
    //         {S3,S4,S5},
    //         {S2,S6,S1},
    //         {S3,S1,S1}
    //     },

    //     // วันที่หก
    //     {
    //         {S3,S1,S6},
    //         {S6,S3,S2},
    //         {S3,S2,S2}
    //     },

    //     // วันที่เจ็ด
    //     {
    //         {S4,S2,S6},
    //         {S3,S1,S2},
    //         {S3,S3,S3}
    //     }
    // };
    
    // actionRelation = {
    //     // วันแรก
    //     {
    //         {4, 4, 3},
    //         {1, 1, 0},
    //         {2, 0, 0}
    //     },
    //     // วันที่สอง
    //     {
    //         {4, 4, 4},
    //         {0, 0, 0},
    //         {1, 2, 1}
    //     },
    //     // วันที่สาม
    //     {
    //         {1, 2, 2},
    //         {0, 0, 0},
    //         {11, 11, 2}
    //     },
    //     // วันที่สี่
    //     {
    //         {4, 4, 5},
    //         {0, 0, 0},
    //         {5, -5, -5}
    //     },
    //     // วันที่ห้า
    //     {
    //         {5, 3, 4},
    //         {-3, 5, 5},
    //         {-3, 4, 3}
    //     },
    //     // วันที่หก
    //     {
    //         {5, 0, 4},
    //         {4, 3, 4},
    //         {5, -3, 3}
    //     },
    //     // วันที่เจ็ด
    //     {
    //         {3, 5, 3},
    //         {3, -4, -3},
    //         {30, 50, -50}
    //     }
    // };

     Ending = {
        "แย่ คุณทำใจยอมรับเรื่องราวที่เกิดขึ้นตรงหน้า",
        "ดี คุณทำให้คุกปั่นป่วนแต่พา nahida หนีไปได้",
        "ดีมาก คุณพา nahida หนีไปได้"
    };


}
