#pragma once

#include "../initGame.h"

class Sakura{
    public:
        Sakura();
        vector<vector<string>> SakuraTalk, userTalk, SakuraQuestions;
        vector<vector<vector<string>>> userAnswers, SakuraAction;
        vector<vector<vector<int>>> actionRelation;
        Texture waifuface1Texture;
        Texture waifuface2Texture;
        Texture waifuface3Texture;
        Texture waifuface4Texture;
        Texture waifuface5Texture;
        Texture waifuface6Texture;
        Sprite waifu2;
};


Sakura::Sakura(){
    
    // ภาพตัวแทนตัวละคร Venti
    waifuface1Texture.loadFromFile("../GG_Game/image/test_charec/IMG_0273.PNG");
    waifuface2Texture.loadFromFile("../GG_Game/image/test_charec/2a_yes.png");
    waifuface3Texture.loadFromFile("../GG_Game/image/test_charec/3a_sadd.png");
    waifuface4Texture.loadFromFile("../GG_Game/image/test_charec/4a_cry.png");
    waifuface5Texture.loadFromFile("../GG_Game/image/test_charec/5a_angry.png");
    waifuface6Texture.loadFromFile("../GG_Game/image/test_charec/6a_happyy.png");

    SakuraTalk = {
        // วันที่ 1
        {   
            ".............................",
            "Sakura : ฮึก (*′☉.̫☉) !!! ",
            "Sakura : เลิกยุ่งกับฉันทีเถอะ (,,Ծ‸Ծ,, ) "
        },
        
        // วันที่ 2
        {   
            "Sakura : ( ◜◒◝ )♡ ง่วงจังง ",
            "Sakura :จะว่าไงดีล่ะก็คนที่ชื่อว่า Neuvillette บอกว่าเขาจะพิพากษาชั้นน่ะสิ",
            "Sakura :ฉันเริ่มชักจะสนใจเธอสะแล้วซิ"
        },
        
        // วันที่ 3
        {   
            "Sakura :สวัสดี คุณผู้คุม....",
            "Sakura :อย่าเงียบซี่........",
            "Sakura :คุยกับเธอนี่มันสนุกดีน่ะ อยากได้ของฝากอ่ะ"
        },
        
        // วันที่ 4
        {   
            "เมื่อคุณมาถึงพบว่า Sakura กำลังหลับอยู่",
            "ตอนนั้นคุณเหลือบไปเห็นรูปภาพที่วางอยู่ใกล้ๆหน้าของเวนติ",
            "Sakura :วันพรุ่งนี้เดี่ยวเล่าเรื่องราว เกี่ยวกับภาพนั้นให้ฟัง"
        },
        
        // วันที่ 5
        {   
            "วันนี้คุณได้มาหาเวนติเพื่อนั่งคุยเล่นปกติ",
            "Sakura :ฉันจะเล่าให้เธอฟังเกี่ยวกับภาพนั้น แต่เล่าปกติไม่สนุกให้ทายล่ะกัน-w-",
            "Sakura :ซึ่งจริงๆในภาพนั้น ก็มีชั้นที่เป็วิญญาณธาตุลมตัวน้อยกับเพื่อนสนิทของข้า"
        },
        
        // วันที่ 6
        {   
            "วันนี้ Sakura หน้าตาดูเศร้าหมอง",
            "Sakura :คุณผู้คุ้มมมมมมม............................",
            "ก่อนที่คุณจะจากไปคุณได้บอกกับ Sakura "
        },
        
        // วันที่ 7
        {   
            "วันตัดสินก็มาถึง",
            "Sakura :วันสุดท้ายแล้วสิน่ะ",
            "คุณได้จากลา Sakura เป็นรอบสุดท้าย"
        }
    };

    userTalk = {
        // วันที่ 1
        {
            "คุณ : เงยหน้าขึ้นมา",
            "คุณ : จะร้องไห้ทำไม",
            "คุณ : ไว้เจอกันนะ หึหึ "
        },
        
        // วันที่ 2
        {
            "คุณ : เมื่อวานหลับสบายไหม ",
            "Sakura :แถมบอกว่ามีเหล้าให้ในคุกแค่นั้นก็เพียงพอแล้ว-3-",
            "คุณ : เธอนี้แปลกดีเหมือนกันไว้ชวนไปบางขวานน่ะ"
        },
        
        // วันที่ 3
        {
            "ทำไมมีกลิ่นเหล้าแปลกๆแถวนี้",
            "คุณ : นี่เธอแอบไปดื่มเหล้ามาใช่ไหม",
            "คุณ : ถ้าว่างเดี่ยวซื้อของฝากมาให้เจอกัน",
        },
        
        // วันที่ 4
        {   
            "Zzzzzzzzz",
            "คุณพยายามเข้าไปดูใกล้ ทันใดนั้น Sakura ก็ตื่นขึ้นพร้อมกับสีหน้าที่ตกใจแล้วถามว่า",
            "แต่ดูยังไง Sakura เหมือนจะมีอะไรจะบอกสักอย่างเลยแฮะ"
        },
        
        // วันที่ 5
        {   
            "คุณ : ฉันมาแล้วจร้า",
            "คุณ : จัดมาดิ",
            "Sakura :แต่นั้นก็เป็นความทรงจำที่ดีน่ะ(Sakura ยิ้มให้คุณก่อนที่คุณจะกลับไปนอน)"
        },
        
        // วันที่ 6
        {
            "ตอนคุณมาถึงหน้าห้อง Sakura เธอได้เปลี่ยนสีหน้าเป็นดีใจอย่างเห็นได้ชัด",
            "คุณ : ทำไมวันนี้เธอดูเศร้าจังก่อนที่ฉันจะมา",
            "คุณ : จงเชื่อในลิขิตของสวรรค์"
        },
        
        // วันที่ 7
        {   
            "คุณได้เดินไปหา Sakura อีกครั้ง",
            "คุณ : เธอยังมีสิ่งที่อยากทำอยู่ไหม",
            "ในใจคุณคิด เทพลมน่ะหรอ รอดูเลย"
        }
    };

    SakuraQuestions = {
        // วันที่ 1
        {   
            "Sakura : // ก้มหน้า ",
            "Sakura : ไอ้นี่คือใครวะเนี่ย (พูดในใจ)",
            "Sakura : คือ...เรา..."
        },
        
        // วันที่ 2
        {   "Sakura :อีตานี่มาอีกแล้ว น่ารำคาญจริงๆ (ซากุระพูดในใจ)",
            "Sakura :พรุ่งนี้ฉันได้รับพิพากษาแล้วสินะ",
            "Sakura :อืม....งั้นชอบกินเหล้าไหมล่ะ"
        },
        
        // วันที่ 3
        { 
            "Sakura :ช่วยพาฉันออกไปที ",
            "Sakura :งั้นถามนายบ้างล่ะชอบตัวละครแบบไหน",
            "Sakura :นายนี่ไม่เบาเลยน่ะ นายมีแฟนยัง"
        },
        
        // วันที่ 4
        {
            "Sakura :นายมาตอนไหนเนี่ย",
            "คุณสังเกตเห็นหน้าของ Sakura ดูแดง คุณเลยถาม ",
            "Sakura :ถ้ามาคราวหน้าคราวหลังก็บอกด้วยเซ่"
        },
        
        // วันที่ 5
        {   
            "Sakura :ร่างในปัจจุบันที่นายเห็นอยู่ตรงหน้าคล้ายกับใคร",
            "Sakura :ต่อไป ชื่อจริ่งของฉันชื่ออะไร",
            "Sakura :คำถามสุดท้าย เราเป็นเพศอะไร"
        },
        
        // วันที่ 6
        {   
            "Sakura กลับไปเป็นหน้าเศร้าหมองอีกครั้ง",
            "Sakura :ไม่ใช่เรื่องอะไรทั้งนั้นแหละ แค่คิดว่าพรุ่งนี้คงเป็นวันสุดท้ายแล้วสิน่ะ",
            "Sakura :ถ้าเราโดนพิพากษา ประหารชีวิตเธอจะทำยังไง"
        },
        
        // วันที่ 7
        {   
            "Sakura :ฉันขอให้ทำอะไรเพื่อฉันหน่อยก่อนจากไปไหม",
            "Sakura :และก่อนที่จากลา นายชอบฉันไหม",
            "Sakura :ไม่ว่ายังไงก็ขอบคุณน่ะที่ดูแลฉันมาตั้ง 7 วันน่ะ"
        }
    };

    userAnswers = {
        // วันที่ 1
        {
            // คำถามที่ 1
            {
                "ใจเย็นๆนะ ", 
                "สบตาฉันสิ", 
                "ไปแก้มัดให้มัน !!!"
            },

            {
                "ไม่ต้องกลัวฉันนะ...", 
                "เธอคิดอะไรอยู่", 
                "//มองหน้า ซากุระ "
            },

            {
                "ฉันจะอยู่ข้างๆเธอ -ω(´•ω•｀)♡ ", 
                "วันนี้พักผ่อนเถอะ", 
                "รีบพูดก่อนที่จะไม่ได้พูด หึหึ "
            }

        },

        // วันที่ 2
        {
            {
                "//คุณเปิดประตูห้องขัง และจากนั้น คุณเดินเข้าไปใกล้ๆซากุระ", 
                "//คุณมองซากุระแล้วยิ้มให้", 
                "//คุณยื่นขนมให้กับซากุระ"
            },

            {
                "อืม ฉันจะคอยดูแลเธอเอง", 
                "เธอไปทำอะไรมา ถึงได้มาอยู่ที่นี่", 
                "ใช่แล้ว แต่ไม่ต้องกลัวหรอกนะ"
            },

            {
                "ไม่อ่ะ", 
                "ถ้าฟรีก็เอา", 
                "ชอบมาเลย"
            }
        },

        // วันที่ 3
        {
            {
                "Jean", 
                "Klee", 
                "Diluc"
            },

            {
                "หล่อเท่ห์ เห็นแล้วใจเกเร", 
                "สวย เบิ้มๆคือลือน่ะ", 
                "น่ารัก ขี้เล่น มีเสน่ห์"
            },

            {
                "มีแล้ว ว้ายเธอไม่มี", 
                "ยังไม่มีเลย T-T", 
                "มีแค่คนคุยอะ",
            }
        },

        // วันที่ 4
        {
            {
                "มาปลุกไง", 
                "มาดูรูปที่วางอยู่ใกล้ๆหน้าเธอไง", 
                "อยากมาดูหน้าเธอไง"
            },
            
            {
                "เป็นไข้หรอ", 
                "อุ้ย เขินหรอ", 
                "เหล้าขึ้นหน้าแน่ๆ 555"
            },

            {
                "ขอโทดๆ", 
                "ราวหน้าจะมาลักหลับน่ะ", 
                "ไม่รู้ๆๆๆๆๆ"
            }   
        },

        // วันที่ 5
        {
            {
                "Vennessa วีรชนผู้ยิ่งใหญ่", 
                "เทพอสูรแห่งพายุ Decarabian", 
                "Florentino มหาเทพแห่งการร่ายรำ"
            },
            
            {
                "Annette สาวน้อยเวทลม", 
                "Barbatos แห่งเทพลม", 
                "Sakura เทพขี้เมา"
            },

            {
                "ชาย", 
                "หญิง", 
                "ไม่มีเพศ แค่น่ารักก็พอแล้วป่ะ"
            }
        },

        // วันที่ 6
        {
            {
                "มีอะไรก็เล่าให้ฟังก็ได้น่ะ", 
                "หิวเหล้าหรอ", 
                "หมายถึงเรื่องรูปวันก่อนหรอ"
            },
            
            {
                "...............", 
                "ช่างเป็นเวลาอันแสนสั้นที่ได้ใช้รวมกับเธอ", 
                "ฉันก็เศร้าเหมือนกันที่พรุ่งนี้เราจะอยู่ด้วยกัน"
            },

            {
                "ฉันจะเป็นคนขัดความการพิพากษาเอง", 
                "เราจะหนีไปด้วนกัน", 
                "มันเป็นกฏของสวรรค์ที่มิอาจหลีกเลี่ยงได้"
            }
        },

        // วันที่ 7
        {
            {
                "เอาเหล้าที่แพงที่สุดให้", 
                "ฉันจะเก็บรูปไว้ในความทรงจำนี้เอง", 
                "...................."
            },
            
            {
                "ชอบสิ", 
                "ไม่ชอบ แต่รักที่สุดเลย", 
                "ไม่อ่ะ"
            },

            {
                "ด้วยความยินดี", 
                "ฉันจะไปคุยกับผู่พิพากษา", 
                "หลบหนี"
            }
        }


    };
    SakuraAction = {
        // วันแรก
        {
            {"Sakura :ฉันใจเย็นอยู่แล้วแหละน่า!!","Sakura : (;´༎ຶٹ༎ຶ`)","Sakura : ขอบคุณนะ ʕ = •́ .̫ •̀ = ʔ "},
            {"Sakura :อือ ... ","Sakura :ฉันอยากกลับบ้านจัง ⁞ ✿ ᵒ̌ ᴥ ᵒ̌ ✿ ⁞ ","Sakura : //เขิน  (⊙﹏⊙✿) "},
            {"Sakura :ขอบคุณนะ", "Sakura :อยู่คุยกันก่อนสิ ‧º·(˚ ˃̣̣̥⌓˂̣̣̥ )‧º·˚ ", "Sakura : ฉันไม่ได้อยากพูดกับเธอหรอกนะ "}
        },
        
        // วันที่สอง
        {
            {"Sakura : ༼ ༎ຶ ෴ ༎ຶ༽ ม่ายน้าา าา าาาาา ", "Sakura : อะไรของเค้า ಠ╭╮ಠ  ", "Sakura : //รับขนมพร้อมกับยิ้มให้  "},
            {"Sakura :เธอช่างอบอุ่นจริงๆเลย ", "เธออย่าไปบอกใครนะ ฉันแค่ปลอมตัวเข้ามาเพื่อตามหาบางอย่างของชีวิต","Sakura : ถ้าฉันออกไปได้ ฉันจะตอบแทนเธอเอง"},
            {"Sakura :ลองหัดดื่มเหล้าสิ 555", "Sakura :ได้ซิเดี่ยวฉันเลี้ยงเอง", "Sakura :ใจตรงกันนิ"}
        },
        
        // วันที่สาม
        {
            {"Sakura :เป็นไปไม่ได้ที่จะให้เหล้าฉัน", "Sakura :คุกนี้น่าจะถล่มมามากกว่าน่ะ", "Sakura :ช่ายแล้ว คนนี้แหละชงเก่งสุดเลย"},
            {"Sakura :รสนิยมโครตแปลก", "Sakura :นายนี่เหมือนผู้ชายปกติเลยนิ","Sakura :งั้นหรอเนี่ยดีใจจัง"},
            {"Sakura :หยอกแรงเหมือนกันน่ะเนี่ย","Sakura :ฉันก็เหมือนกันน่ะ", "Sakura :อืม....น่าสนใจ"}
        },
        
        // วันที่สี่
        {
            {"Sakura :อ่อหรอ.................", "Sakura :.............", "Sakura :หาาาาาา............."},
            {"Sakura :เปล่าหรอก...ฮึ่ม", "Sakura :อย่ามากพูดบ้าๆ..ฮึ่ย", "Sakura :สัสเอ้ย....555"},
            {"Sakura :ไม่เป็นไร แต่ก็น่ะ", "Sakura :โรคจิต แต่ก็....", "Sakura  :ช่างเถอะ"}
        },
        
        // วันที่ห้า
        {
            {"Sakura :ถูกแล้ว", "Sakura :หมอนั้นเป็นมังกรน่ะ 555 ไม่ใชาหรอก", "Sakura :ใครครับเนี่ย555"},
            {"Sakura :ติดเกมหรอเนี่ย ไม่ใช่หรอ", "Sakura :ถูกแล้วจร้า", "Sakura :อันนั้นแค่สมที่ทุกคนคิดแบบนั้น"},
            {"Sakura :ก็ใช่น่ะ แต่ไม่ถูกเสมอไป", "Sakura :ฉันน่ารักขนาดนั้นเลยหรอ", "Sakura  :อุ้ย...พูดมาก็ถูกต้อง(เขิน)"}
        },
        
        // วันที่หก
        {
            {"Sakura :ก็น่ะ", "Sakura :คิดว่าฉันเป็นขี้เหล้ามากหรือไงห่ะ", "Sakura :ไม่ใช่หรอก"},
            {"Sakura :..................","Sakura :ฉันก็คิดอยู่เหมือนกัน", "หน้าของ Sakura กลับไปเศร้าและถามว่า"},
            {"Sakura :งั้นหรอฝากด้วยน่ะ","Sakura :พูดจริงอ่ะ", "Sakura :งั้นสิน่ะ"}
        },
        
        // วันที่เจ็ด
        {
            {"Sakura :นั้นคงเป็นความทรงจำที่ดีที่จได้ดื่มด้วยกัน", "Sakura :ขอบใจน่ะที่นายยังเก็บชั้นในความทรงจำ", "Sakura :อย่าเงียบซิฉันก็เศร้าน่ะ"},
            {"Sakura :ฉันก็ชอบนายน่ะ", "Sakura ได้ดึงคุณเข้าไปจูบกะทันหันก็ที่จะพูดออก", "Sakura :.............................."},
            {"Sakura :เช่นกัน","คุณได้ ending เคลียร์ใจ", "คุณได้ ending  escape"}
        }
    };
    actionRelation = {
        // วันแรก
        {
            {5, 0, 0},
            {0, 0, 5},
            {2, 5, 2}
        },
        // วันที่สอง
        {
            {0, 0, 5},
            {5, 5, 4},
            {-2, 0, 5}
        },
        // วันที่สาม
        {
            {0, -2, 5},
            {0, 0, 5},
            {-5, 5, 2}
        },
        // วันที่สี่
        {
            {2, 3, 5},
            {3, 5, -5},
            {5, -5, 2}
        },
        // วันที่ห้า
        {
            {5, 0, 0},
            {0, 5, 3},
            {2, 2, 5}
        },
        // วันที่หก
        {
            {5, -5, 4},
            {0, 5, 4},
            {5, 5, 3}
        },
        // วันที่เจ็ด
        {
            {3, 5, 1},
            {3, 5, 0},
            {3, 200, 500}
        }
    };
}
